config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Nasser Alkmim

* Introduction
This conficuration was copied and modified from [[https://github.com/danielmai/.emacs.d][Daniel's configuration]].

Download [[http://vgoulet.act.ulaval.ca/en/emacs/windows/][Emacs]] from this site which includes the support for png, jpeg images. Or [[http://emacsbinw64.sourceforge.net/][From this site]].
  
This configuration uses the [[https://github.com/jwiegley/use-package][use-package]] package from John Wiegley, which is
a fantastic way to manage package configurations. This [[http://www.lunaryorn.com/2015/01/06/my-emacs-configuration-with-use-package.html][post]] explain how it works.

This [[http://emacs.stackexchange.com/questions/10396/difference-between-init-and-config-in-use-package][Question]] is useful to understand the differences between init and config. Basically, bind and init are evaluated immediately after start up which contributes to startup time, config is deferred until the pacakge is loaded (by a bind key or a specific mode).

Current load time 1.5s on windows.

* Personal information

 #+begin_src emacs-lisp
(setq user-full-name "Nasser Alkmim"
      user-mail-address "nasser.alkmim@gmail.com")
#+end_src

* Theme
** Moe theme
#+BEGIN_SRC emacs-lisp
(use-package moe-theme
  :ensure t
  :defer t
  :init
  (require 'moe-theme)
)
#+END_SRC
** Leuven theme
#+BEGIN_SRC emacs-lisp
(use-package leuven-theme
  :ensure t
  :defer t)
#+END_SRC
** Anti Zenburn
#+BEGIN_SRC emacs-lisp
(use-package anti-zenburn-theme
  :ensure t
  :init
  (load-theme 'anti-zenburn t))
#+END_SRC
** Material theme

#+begin_src emacs-lisp
(use-package material-theme
  :defer t
  :ensure t)  
#+end_src

** Cyberpunk theme

#+BEGIN_SRC emacs-lisp
(use-package cyberpunk-theme
  :defer t
  :ensure t)
#+END_SRC

** Zenburn
#+BEGIN_SRC emacs-lisp
(use-package zenburn-theme
  :defer t
  :ensure t)
#+END_SRC
** Solarized 
#+BEGIN_SRC emacs-lisp
(use-package solarized-theme
  :ensure t
  :defer t)
#+END_SRC
** Sanityinc tomorrow
#+BEGIN_SRC emacs-lisp
(use-package color-theme-sanityinc-tomorrow
  :ensure t
  :defer t)
#+END_SRC
** Theme looper

#+begin_src emacs-lisp
(use-package theme-looper
  :defer t
  :ensure t
  :bind ("S-<f12>" . theme-looper-enable-next-theme)
  :init
  (theme-looper-set-theme-set '(moe-light
                                ;moe-dark
                                leuven
                                anti-zenburn
                                ;material
                                ;material-light
                                ;zenburn
                                cyberpunk
                                ;solarized-light
                                ;sanityinc-tomorrow-day
                                ))
  (theme-looper-set-customizations 'powerline-reset))
#+end_src

the function load-theme will first disable the active themes, before loading the new one.

#+BEGIN_SRC emacs-lisp
(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))

(defadvice load-theme (before disable-themes-first activate)
  (disable-all-themes))
#+END_SRC

* Font
Download [[https://github.com/adobe-fonts/source-code-pro][Source Code Pro]]

#+begin_src emacs-lisp
(set-face-attribute 'default nil
                    :family "Source Code Pro" :height 100)
#+end_src

* Common defaults

Sources for this section include [[https://github.com/magnars/.emacs.d/blob/master/settings/sane-defaults.el][Magnars Sveen]] and [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua]].

#+begin_src emacs-lisp
;; These functions are useful. Activate them.
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)

;; Answering just 'y' or 'n' will do
(defalias 'yes-or-no-p 'y-or-n-p)

;; UTF-8 please
(setq locale-coding-system 'utf-8) ; pretty
(set-terminal-coding-system 'utf-8) ; pretty
(set-keyboard-coding-system 'utf-8) ; pretty
(set-selection-coding-system 'utf-8) ; please
(prefer-coding-system 'utf-8) ; with sugar on top
;; from Sacha page
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(setq-default indent-tabs-mode nil)

;; use shift-arrows to move between windows
(windmove-default-keybindings)

;; highlight current line
(global-hl-line-mode 1)

; wrap lines
(global-visual-line-mode)
(diminish 'visual-line-mode)

;; Turn off the blinking cursor
(blink-cursor-mode -1)

(setq-default indent-tabs-mode nil)
(setq-default indicate-empty-lines t)

;; Don't count two spaces after a period as the end of a sentence.
;; Just one space is needed.
(setq sentence-end-double-space nil)

;; delete the region when typing, just like as we expect nowadays.
(delete-selection-mode t)


(column-number-mode t)


(setq uniquify-buffer-name-style 'forward)


;; Don't beep at me
(setq visible-bell t)

;; Don't create backups
(setq make-backup-files nil)
#+end_src

* Recentf
Recentf is a minor mode that builds a list of recently opened files.

#+begin_src emacs-lisp
(use-package recentf
  :defer 10
  :config
  (progn
    (recentf-mode t)
    (setq recentf-max-saved-items 200
          recentf-max-menu-items 15)))
#+end_src

* Org mode
** Basic Initialization

#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure t
  :defer t
  :bind(("C-c a" . org-agenda)
        ("C-c l" . org-store-link)
        ("C-c c" . org-capture))
  :config
  (add-hook 'org-mode-hook 'company-mode)
  (add-hook 'org-mode-hook 'flycheck-mode))
#+END_SRC

** Modules

Modules to experiment in my workflow.

#+BEGIN_SRC emacs-lisp
(setq org-modules '(org-habit))

(eval-after-load 'org
 '(org-load-modules-maybe t))
#+END_SRC

*** Habits

A special category of TODO's, habits. A habit is a task that is constantly repeating. In my case, I plan to use it for:

1. Books that I am reading, reading every day.
2. My thesis progress.

Some properties:
- blue if the task wasn't to be done yet
- green if the task could have been done on that day
- yellow if the task was going to be overdue the next day
- red if the task was overdue on that days
- asterisk if the task was done on that day!
- exclamation show where the current day falls in the graph

From [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha]].

#+BEGIN_SRC emacs-lisp
(setq org-habit-graph-column 80)
;(setq org-habit-show-habits-only-for-today nil)
#+END_SRC

** Shortcut to organizer file

From [[http://sachachua.com/blog/2015/02/learn-take-notes-efficiently-org-mode/][This blog entry]], C-c o is set to open the tasks.org

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c o") 
                (lambda () (interactive) (find-file "~/OneDrive/Org/notes.org")))
#+END_SRC

** Agenda

Set agenda files

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files
      (delq nil
            (mapcar (lambda (x) (and (file-exists-p x) x))
                    '("~/OneDrive/Org/gtd.org"
                      "~/OneDrive/Org/notes.org"
                      "~/OneDrive/Org/culture.org"
                      "~/OneDrive/ANAC/anac.org"
))))
#+END_SRC

remove done tasks from the agenda, from [[http://stackoverflow.com/questions/8281604/remove-done-tasks-from-agenda-view][this question]].

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-skip-deadline-if-done t))
#+END_SRC

** Capture

Set gtd.org as my default notes file

#+BEGIN_SRC emacs-lisp
(setq org-default-notes-file "~/OneDrive/Org/gtb.org")
#+END_SRC

*** Capture templates

The templates were copied from [[http://members.optusnet.com.au/~charles57/GTD/datetree.html][This Tutorial]].

So far I have the following templates:
1. *Todo*: will be used for defining daily or weekly tasks and reminders.
   - TODO keyword
   - %^{Description} prompt for user input
   - %^g prompt for tags
   - %? position cursor here
   - %U inactive timestamp
2. *Notes*: Any kind of note, books, movies, blog post ideas.
   - %^{Description} prompt for user input
   - %^g prompt for tags
   - %? position cursor here
   - %U inactive timestamp
3. *Books*: Save books that I'm reading, scheduled than so I read the minimum quota daily, notes and review.


#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      '(
("t" "Todo" entry (file+datetree "~/OneDrive/Org/gtd.org") 
"* TODO %?

Added: %U")

("n" "Notes" entry (file+datetree "~/OneDrive/Org/notes.org") 
"* %^{Description} %^g 

%?
 
Added: %U")

("b" "Books" entry (file+headline "~/OneDrive/Org/culture.org" "Books")
"* STRT %^{Title} 
SCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a +1d>>\")
:PROPERTIES:
:STYLE:    habit
:END:


,*Author(s):* %^{Author}
,*Pages/Day:* %^{P/D}
,*Review/Comments:*

%?

,*Added*: %U" )

("m" "Movies" entry (file+headline "~/OneDrive/Org/culture.org" "Movies")
"* %^{Title}

,*Review/Comments:*

%?

,*Added*: %U"
)

("p" "Post" plain (file  (blog-post-new))
 "Title: %^{Title}
Date: %<%Y-%m-%d %H:%M>
Category: %^{Category}
Tags: %^{Tags}

%?

"
)
      
))
#+END_SRC

