config.el
(setq user-full-name "Nasser Alkmim"
      user-mail-address "nasser.alkmim@gmail.com")

(use-package moe-theme
  :ensure t
  :defer t
  :init
  (require 'moe-theme)
)

(use-package leuven-theme
  :ensure t
  :defer t)

(use-package anti-zenburn-theme
  :ensure t
  :init
  (load-theme 'anti-zenburn t))

(use-package material-theme
  :defer t
  :ensure t)  

(use-package cyberpunk-theme
  :defer t
  :ensure t)

(use-package zenburn-theme
  :defer t
  :ensure t)

(use-package solarized-theme
  :ensure t
  :defer t)

(use-package color-theme-sanityinc-tomorrow
  :ensure t
  :defer t)

(use-package theme-looper
  :defer t
  :ensure t
  :bind ("S-<f12>" . theme-looper-enable-next-theme)
  :init
  (theme-looper-set-theme-set '(moe-light
                                ;moe-dark
                                leuven
                                anti-zenburn
                                ;material
                                ;material-light
                                ;zenburn
                                cyberpunk
                                ;solarized-light
                                ;sanityinc-tomorrow-day
                                ))
  (theme-looper-set-customizations 'powerline-reset))

(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))

(defadvice load-theme (before disable-themes-first activate)
  (disable-all-themes))

(set-face-attribute 'default nil
                    :family "Source Code Pro" :height 100)

;; These functions are useful. Activate them.
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)

;; Answering just 'y' or 'n' will do
(defalias 'yes-or-no-p 'y-or-n-p)

;; UTF-8 please
(setq locale-coding-system 'utf-8) ; pretty
(set-terminal-coding-system 'utf-8) ; pretty
(set-keyboard-coding-system 'utf-8) ; pretty
(set-selection-coding-system 'utf-8) ; please
(prefer-coding-system 'utf-8) ; with sugar on top
;; from Sacha page
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(setq-default indent-tabs-mode nil)

;; use shift-arrows to move between windows
(windmove-default-keybindings)

;; highlight current line
(global-hl-line-mode 1)

; wrap lines
(global-visual-line-mode)
(diminish 'visual-line-mode)

;; Turn off the blinking cursor
(blink-cursor-mode -1)

(setq-default indent-tabs-mode nil)
(setq-default indicate-empty-lines t)

;; Don't count two spaces after a period as the end of a sentence.
;; Just one space is needed.
(setq sentence-end-double-space nil)

;; delete the region when typing, just like as we expect nowadays.
(delete-selection-mode t)


(column-number-mode t)


(setq uniquify-buffer-name-style 'forward)


;; Don't beep at me
(setq visible-bell t)

;; Don't create backups
(setq make-backup-files nil)

(use-package recentf
  :defer 10
  :config
  (progn
    (recentf-mode t)
    (setq recentf-max-saved-items 200
          recentf-max-menu-items 15)))

(use-package org
  :ensure t
  :defer t
  :bind(("C-c a" . org-agenda)
        ("C-c l" . org-store-link)
        ("C-c c" . org-capture))
  :config
  (add-hook 'org-mode-hook 'company-mode)
  (add-hook 'org-mode-hook 'flycheck-mode))

(setq org-modules '(org-habit))

(eval-after-load 'org
 '(org-load-modules-maybe t))

(setq org-habit-graph-column 80)
;(setq org-habit-show-habits-only-for-today nil)

(global-set-key (kbd "C-c o") 
                (lambda () (interactive) (find-file "~/OneDrive/Org/notes.org")))

(setq org-agenda-files
      (delq nil
            (mapcar (lambda (x) (and (file-exists-p x) x))
                    '("~/OneDrive/Org/gtd.org"
                      "~/OneDrive/Org/notes.org"
                      "~/OneDrive/Org/culture.org"
                      "~/OneDrive/ANAC/anac.org"
))))

(custom-set-variables
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-skip-deadline-if-done t))

(setq org-default-notes-file "~/OneDrive/Org/gtb.org")

(setq org-capture-templates
      '(
("t" "Todo" entry (file+datetree "~/OneDrive/Org/gtd.org") 
"* TODO %?

Added: %U")

("n" "Notes" entry (file+datetree "~/OneDrive/Org/notes.org") 
"* %^{Description} %^g 

%?
 
Added: %U")

("b" "Books" entry (file+headline "~/OneDrive/Org/culture.org" "Books")
"* STRT %^{Title} 
SCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a +1d>>\")
:PROPERTIES:
:STYLE:    habit
:END:


*Author(s):* %^{Author}
*Pages/Day:* %^{P/D}
*Review/Comments:*

%?

*Added*: %U" )

("m" "Movies" entry (file+headline "~/OneDrive/Org/culture.org" "Movies")
"* %^{Title}

*Review/Comments:*

%?

*Added*: %U"
)

("p" "Post" plain (file  (blog-post-new))
 "Title: %^{Title}
Date: %<%Y-%m-%d %H:%M>
Category: %^{Category}
Tags: %^{Tags}

%?

"
)
      
))
