config.org
** Options

Start up folded, lists will be folded when file is opened. Don't remember where I got that.
#+BEGIN_SRC emacs-lisp
(setq org-cycle-include-plain-lists 'integrate)
#+END_SRC

Org display inline images when starts up, [[http://emacs.stackexchange.com/questions/14758/in-org-mode-how-to-always-display-inline-images-at-emacs-startup][From this question]].
#+BEGIN_SRC emacs-lisp
(setq org-startup-with-inline-images t)
#+END_SRC

Speed up commands. See the doc for speed keys by checking out [[elisp:(info%20"(org)%20speed%20keys")][the documentation for speed keys in Org mode]].
#+begin_src emacs-lisp
(setq org-use-speed-commands t)
#+end_src

General options.
#+BEGIN_SRC emacs-lisp
(setq org-special-ctrl-a/e t)
(transient-mark-mode nil)
(setq org-log-done 'time) ;Log the time a task is completed.
(setq org-habit-graph-column 50) ;position the habit graph on the agenda to the right of the default
(setq org-hide-emphasis-markers nil)
(setq org-src-fontify-natively t)
(setq inhibit-splash-screen t)
(setq org-indent-mode t) ;indent the headings for clean view
(diminish 'org-indent-mode)
(setq org-startup-indented t)
(setq org-tags-column -96) ;where the tags are places
 #+END_SRC

Todo sequences.
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords '((sequence "TODO(t)" "STRT(s)" "DONE(d)")))
(setq org-todo-keyword-faces 
      '(
         ("TODO" :background "tomato" :foreground "#5f5f5f" :weight bold )
         ("STRT" :background "#edd400" :foreground "#5f5f5f" :weight bold )
         ("DONE" :background "#6ac214" :foreground "#5f5f5f" :weight bold )))
#+END_SRC

From [[http://stackoverflow.com/questions/28351465/emacs-orgmode-do-not-insert-line-between-headers][This question]], an option for org mode not insert a line between headings.
#+BEGIN_SRC emacs-lisp
(setq org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
#+END_SRC

[[http://orgmode.org/manual/Headlines.html][This reference]] is used to remove an annoying feature of not hiding extra lines in a subtree
#+BEGIN_SRC emacs-lisp
(setq org-cycle-separator-lines 0)
#+END_SRC


** Org babel/source blocks

#+begin_src emacs-lisp
(setq org-src-fontify-natively t
      org-src-window-setup 'current-window
      org-src-strip-leading-and-trailing-blank-lines t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t)
#+end_src

** Org paste from clipboard

Function for pasting images from clipboard. I got this from [[https://lists.gnu.org/archive/html/emacs-orgmode/2013-11/msg00290.html][this thread]]. It's very useful when I'm writing notes while studying, great for reviewing the notes later.

Now it creates a folder called "img/" where all the figures are going to be saved.

#+BEGIN_SRC emacs-lisp
(defun my/org-insert-clipboard ()
  (interactive)
  ;make the img directory
  (setq myvar/folder-path (concat default-directory "img/"))
  ;create the directory if it doesn't exist
  (if (not (file-exists-p myvar/folder-path))
      (mkdir myvar/folder-path))

  (let* ((image-file (concat 
                      myvar/folder-path
                      (buffer-name)
                      "_"
                      (format-time-string "%Y%m%d_%H%M%S_.png")))

	 (exit-status
	  (call-process "convert" nil nil nil
			"clipboard:" image-file)))

    (org-insert-link nil (concat "file:" image-file) "")

    (org-display-inline-images)))

(global-set-key (kbd "C-c y") 'my/org-insert-clipboard)
#+END_SRC

** Org BG level 1 and 2
This is for remove the annoying background color on the headings, level 1 and level 2, when using the material-theme.

#+BEGIN_SRC emacs-lisp
(custom-set-faces

  '(org-level-1 ((t (:background nil :bold t :overline nil))))

  '(org-level-2 ((t (:background nil :bold t :overline nil)))))
#+END_SRC
** Org pomodoro

[[https://github.com/lolownia/org-pomodoro][This package]] adds the pomodoro (timer) technique into org-mode. I'll try it for studying.

#+BEGIN_SRC emacs-lisp
(use-package org-pomodoro
  :ensure t
  :bind ("<f12>" . org-pomodoro))
#+END_SRC
** Blog post

This is an attempt to create a workflow for blog posts, the referece is this [[http://pasoev.github.io/programming/2015/10/31/jekyll-posts-emacs-capture/][Blog post]].

First a function to return the date of the blog post.
#+BEGIN_SRC emacs-lisp
(defun today-date ()
  (format-time-string "%Y-%m-%d"))
#+END_SRC

A function to ask for the post title
#+BEGIN_SRC emacs-lisp
(defun blog-title ()
  (interactive)
  (read-string "Blog title: "))
#+END_SRC

A function for creating a markdown file with the name based on the date and a title which should be at the top of the kill-ring.
#+BEGIN_SRC emacs-lisp
(defun blog-post-new ()
  (let ((title
         (blog-title)))
  (concat (file-name-as-directory "C:/Users/Nasser/Onedrive/nasseralkmim.github.io/blog/content")
          (today-date) "-" title ".md")))
#+END_SRC

* Shell

#+begin_src emacs-lisp
(bind-key "C-x m" 'shell)
(bind-key "C-x M" 'ansi-term)
#+end_src

* ELPA packages
** Ace Jump Mode
   
A quick way to jump around text in buffers.

[[http://emacsrocks.com/e10.html][See Emacs Rocks Episode 10 for a screencast.]]

#+begin_src emacs-lisp
(use-package ace-jump-mode
  :ensure t
  :diminish ace-jump-mode
  :commands ace-jump-mode
  :bind ("C-x C-x" . ace-jump-mode))
#+end_src

** Ace Window

[[https://github.com/abo-abo/ace-window][ace-window]] is a package that uses the same idea from ace-jump-mode for
buffer navigation, but applies it to windows. The default keys are
1-9, but it's faster to access the keys on the home row, so that's
what I have them set to (with respect to Dvorak, of course).

#+begin_src emacs-lisp
(use-package ace-window
  :ensure t
  :config
  (setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?s))
  (ace-window-display-mode)
  :bind ("C-o" . ace-window))
#+end_src

** Helm

#+begin_src emacs-lisp
(use-package helm
  :ensure t
  :diminish helm-mode
  :init
  (require 'helm-config)
  :config 
  (helm-mode)
  (helm-autoresize-mode t)
  (setq helm-display-header-line nil)
  (setq helm-split-window-in-side-p t)
  (bind-key "<tab>" #'helm-execute-persistent-action helm-map)

  :bind (("C-c h" . helm-command-prefix)
         ("C-x b" . helm-mini)
         ("C-x f"   . helm-multi-files)
         ("C-`" . helm-resume)
         ("M-x" . helm-M-x)
         ("C-x C-f" . helm-find-files)))
#+end_src
   
** Helm swiper
#+BEGIN_SRC emacs-lisp
(use-package swiper-helm
  :bind (("C-s" . swiper-helm)
         ("C-r" . swiper-helm))
  :ensure t
  :config
  (setq swiper-helm-display-function 'helm-default-display-buffer))
#+END_SRC
** Magit


A great interface for git projects. It's much more pleasant to use
than the git interface on the command line. Use an easy keybinding to
access magit.

#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status)
  :config
  (define-key magit-status-mode-map (kbd "q") 'magit-quit-session))
#+end_src

*** Fullscreen magit

#+BEGIN_QUOTE
The following code makes magit-status run alone in the frame, and then
restores the old window configuration when you quit out of magit.

No more juggling windows after commiting. It's magit bliss.
#+END_QUOTE
[[http://whattheemacsd.com/setup-magit.el-01.html][Source: Magnar Sveen]]

#+begin_src emacs-lisp
;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))
#+end_src

** Emacs IPython Notebook

#+begin_src emacs-lisp
(use-package ein
  :defer t
  :disabled t
  :ensure t)
#+end_src

** Markdown mode

#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode (("\\.markdown\\'" . markdown-mode)
         ("\\.md\\'"       . markdown-mode)))
#+end_src

** Projectile

From John Wiegley.


#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :diminish projectile-mode
  :commands projectile-global-mode
  :bind-keymap ("C-c p" . projectile-command-map)
  :config
  (use-package helm-projectile
    :config
    (setq projectile-completion-system 'helm)
    (helm-projectile-on)
    (setq projectile-indexing-method 'alien))
  (projectile-global-mode))
#+end_src

** Python

Integrates with Python.

#+begin_src emacs-lisp
(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :ensure t
  :config
  (add-hook 'python-mode-hook 'company-mode)
  (add-hook 'python-mode-hook 'flycheck-mode))
#+end_src

** Smartparens

#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :diminish smartparens-mode
  :config
  (use-package smartparens-config)
  (smartparens-global-mode)
  (show-smartparens-global-mode t)
  (sp-local-pair 'org-mode "_" "_" )
  (sp-local-pair 'org-mode "*" "*" ))
#+end_src

** Smoothscrolling

This makes it so ~C-n~-ing and ~C-p~-ing won't make the buffer jump
around so much.

#+begin_src emacs-lisp
(use-package smooth-scrolling
  :defer t
  :disabled t
  :ensure t)
#+end_src

** AucTex
*** Basic setup

Enable [[https://www.gnu.org/software/auctex/manual/auctex.html][Auctex]] when files with .tex are loaded. Tex-master is  useful to make Auctex aware of multi-files documents. TeX-PDF mode is used to compile using pdflatex.

#+begin_src emacs-lisp
(use-package tex
  :ensure auctex
  :defer t
  :config
  (load "auctex.el" nil nil t)
  (setq global-font-lock-mode t)
  (add-hook 'TeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'flycheck-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (add-hook 'LaTeX-mode-hook 'company-mode)
  (setq reftex-bibliography-commands '("bibliography" "nobibliography" "addbibresource"))
  (setq reftex-plug-into-AUCTeX t)
  (setq-default TeX-PDF-mode t)
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil))
#+end_src

