config.el

(setq org-cycle-include-plain-lists 'integrate)

(setq org-startup-with-inline-images t)

(setq org-use-speed-commands t)

(setq org-special-ctrl-a/e t)
(transient-mark-mode nil)
(setq org-log-done 'time) ;Log the time a task is completed.
(setq org-habit-graph-column 50) ;position the habit graph on the agenda to the right of the default
(setq org-hide-emphasis-markers nil)
(setq org-src-fontify-natively t)
(setq inhibit-splash-screen t)
(setq org-indent-mode t) ;indent the headings for clean view
(diminish 'org-indent-mode)
(setq org-startup-indented t)
(setq org-tags-column -96) ;where the tags are places

(setq org-todo-keywords '((sequence "TODO(t)" "STRT(s)" "DONE(d)")))
(setq org-todo-keyword-faces 
      '(
         ("TODO" :background "tomato" :foreground "#5f5f5f" :weight bold )
         ("STRT" :background "#edd400" :foreground "#5f5f5f" :weight bold )
         ("DONE" :background "#6ac214" :foreground "#5f5f5f" :weight bold )))

(setq org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))

(setq org-cycle-separator-lines 0)

(setq org-src-fontify-natively t
      org-src-window-setup 'current-window
      org-src-strip-leading-and-trailing-blank-lines t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t)

(defun my/org-insert-clipboard ()
  (interactive)
  ;make the img directory
  (setq myvar/folder-path (concat default-directory "img/"))
  ;create the directory if it doesn't exist
  (if (not (file-exists-p myvar/folder-path))
      (mkdir myvar/folder-path))

  (let* ((image-file (concat 
                      myvar/folder-path
                      (buffer-name)
                      "_"
                      (format-time-string "%Y%m%d_%H%M%S_.png")))

	 (exit-status
	  (call-process "convert" nil nil nil
			"clipboard:" image-file)))

    (org-insert-link nil (concat "file:" image-file) "")

    (org-display-inline-images)))

(global-set-key (kbd "C-c y") 'my/org-insert-clipboard)

(custom-set-faces

  '(org-level-1 ((t (:background nil :bold t :overline nil))))

  '(org-level-2 ((t (:background nil :bold t :overline nil)))))

(use-package org-pomodoro
  :ensure t
  :bind ("<f12>" . org-pomodoro))

(defun today-date ()
  (format-time-string "%Y-%m-%d"))

(defun blog-title ()
  (interactive)
  (read-string "Blog title: "))

(defun blog-post-new ()
  (let ((title
         (blog-title)))
  (concat (file-name-as-directory "C:/Users/Nasser/Onedrive/nasseralkmim.github.io/blog/content")
          (today-date) "-" title ".md")))

(bind-key "C-x m" 'shell)
(bind-key "C-x M" 'ansi-term)

(use-package ace-jump-mode
  :ensure t
  :diminish ace-jump-mode
  :commands ace-jump-mode
  :bind ("C-x C-x" . ace-jump-mode))

(use-package ace-window
  :ensure t
  :config
  (setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?s))
  (ace-window-display-mode)
  :bind ("C-o" . ace-window))

(use-package helm
  :ensure t
  :diminish helm-mode
  :init
  (require 'helm-config)
  :config 
  (helm-mode)
  (helm-autoresize-mode t)
  (setq helm-display-header-line nil)
  (setq helm-split-window-in-side-p t)
  (bind-key "<tab>" #'helm-execute-persistent-action helm-map)

  :bind (("C-c h" . helm-command-prefix)
         ("C-x b" . helm-mini)
         ("C-x f"   . helm-multi-files)
         ("C-`" . helm-resume)
         ("M-x" . helm-M-x)
         ("C-x C-f" . helm-find-files)))

(use-package swiper-helm
  :bind (("C-s" . swiper-helm)
         ("C-r" . swiper-helm))
  :ensure t
  :config
  (setq swiper-helm-display-function 'helm-default-display-buffer))

(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status)
  :config
  (define-key magit-status-mode-map (kbd "q") 'magit-quit-session))

;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))

(use-package ein
  :defer t
  :disabled t
  :ensure t)

(use-package markdown-mode
  :ensure t
  :mode (("\\.markdown\\'" . markdown-mode)
         ("\\.md\\'"       . markdown-mode)))

(use-package projectile
  :ensure t
  :diminish projectile-mode
  :commands projectile-global-mode
  :bind-keymap ("C-c p" . projectile-command-map)
  :config
  (use-package helm-projectile
    :config
    (setq projectile-completion-system 'helm)
    (helm-projectile-on)
    (setq projectile-indexing-method 'alien))
  (projectile-global-mode))

(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :ensure t
  :config
  (add-hook 'python-mode-hook 'company-mode)
  (add-hook 'python-mode-hook 'flycheck-mode))

(use-package smartparens
  :ensure t
  :diminish smartparens-mode
  :config
  (use-package smartparens-config)
  (smartparens-global-mode)
  (show-smartparens-global-mode t)
  (sp-local-pair 'org-mode "_" "_" )
  (sp-local-pair 'org-mode "*" "*" ))

(use-package smooth-scrolling
  :defer t
  :disabled t
  :ensure t)

(use-package tex
  :ensure auctex
  :defer t
  :config
  (load "auctex.el" nil nil t)
  (setq global-font-lock-mode t)
  (add-hook 'TeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'flycheck-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (add-hook 'LaTeX-mode-hook 'company-mode)
  (setq reftex-bibliography-commands '("bibliography" "nobibliography" "addbibresource"))
  (setq reftex-plug-into-AUCTeX t)
  (setq-default TeX-PDF-mode t)
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil))
