config.org
*** Latex preview pane

shell-escape mode because the pacakge svg requires it.

#+BEGIN_SRC emacs-lisp
(use-package latex-preview-pane
  :ensure t
  :bind ("M-p" . latex-preview-pane-mode)
  :config
  (setq doc-view-ghostscript-program "gswin64c")
  (custom-set-variables
   '(shell-escape-mode "-shell-escape")))
#+END_SRC

*** Folding 

[[https://www.gnu.org/software/auctex/manual/auctex/Folding.html][From this manual]], folding macros and environments to avoind clutter.

#+BEGIN_SRC emacs-lisp
;; activate fold mode
;(add-hook 'LaTeX-mode-hook (lambda ()
;                             (TeX-fold-mode 1)))
; hide foldable items automatically
;(add-hook 'find-file-hook 'TeX-fold-buffer t)
#+END_SRC

*** Outline document

[[http://www.gnu.org/software/auctex/manual/auctex/Outline.html][From this section of the manual]], outline for better view content.

#+BEGIN_SRC emacs-lisp
;(add-hook 'LaTeX-mode-hook 'outline-minor-mode)
#+END_SRC

** Reftex

[[http://www.gnu.org/software/auctex/manual/reftex.html#SEC2][RefTex website]]. Useful for managing cross references, bibliographies, indices, and document navigation.

#+BEGIN_SRC emacs-lisp
(use-package reftex
  :ensure t)
#+END_SRC

** Magic Latex Buffer
#+begin_src emacs-lisp
(use-package magic-latex-buffer
  :load-path ("C:/Users/Nasser/.emacs.d/elpa/magic-latex-buffer-master")
  :config
  (add-hook 'LaTeX-mode-hook 'magic-latex-buffer)
  (setq magic-latex-enable-block-highlight nil
      magic-latex-enable-suscript        t
      magic-latex-enable-pretty-symbols  t
      magic-latex-enable-block-align     nil
      magic-latex-enable-inline-image    nil))
#+end_src

** Flycheck


#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :bind ("S-<f5>" . flycheck-mode))
#+END_SRC



** Flyspell
#+BEGIN_SRC emacs-lisp
(use-package flyspell
  :ensure t
  :bind ("S-<f6>" . flyspell-mode)
  :config
  ;; path to Aspell
  (add-to-list 'exec-path "C:/Program Files (x86)/Aspell/bin/")
  ;; use aspell
  (setq ispell-program-name "aspell")
  ;; where the dictionay is
  (setq ispell-personal-dictionary "C:/Program Files (x86)/Aspell/dict")
  ;; change dictionaries
  (defun fd-switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
    	 (change (if (string= dic "brasileiro") "english" "brasileiro")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))
  (global-set-key (kbd "<f6>")   'fd-switch-dictionary)
  (global-set-key (kbd "C-<f1>") 'flyspell-correct-word-before-point))
#+END_SRC
** Company
Auto complete

The configurations were taken from [[https://github.com/company-mode/company-mode/issues/68][This discussion]]. The delay time from the wiki. This [[https://www.reddit.com/r/emacs/comments/3s5bkf/companymode_configuration_make_editing_slow/][reddit thread]] has some cool configurations.

#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :diminish company-mode
  :config
  (setq company-idle-delay 0)
  (setq company-show-numbers t)
  (setq company-minimum-prefix-length 2))
#+END_SRC
** Undo tree


Undo system to recover any past state of a buffer
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :defer t
  :ensure t
  :bind ("C-z" . undo-tree-undo)
  :diminish undo-tree-mode
  :config
  (progn
    (global-undo-tree-mode)
    (setq undo-tree-visualizer-diff t)))
#+END_SRC

** Workgroups

[[https://github.com/pashinin/workgroups2][Work Groups]] for emacs, it saves sessions.

1. ~C-c z C-f~ to laod and start workgroups
2. ~C-c z v~ switch to workgroup
3. ~C-c z c~ create workgroup
4. ~C-c z k~ kill workgroup
5. ~C-c z C-s~ save session


#+BEGIN_SRC emacs-lisp
(use-package workgroups2
  :ensure t
  :bind (("C-c 1" . wg-reload-session)
         ("C-c 2" . wg-switch-to-workgroup)
         ("C-c z z" . wg-save-session))
  :config
  (workgroups-mode 1))
  #+END_SRC
** Centered cursor

#+BEGIN_SRC emacs-lisp
(use-package centered-cursor-mode
  :ensure t
  :diminish centered-cursor-mode
;  :disabled t
  :config
  (global-centered-cursor-mode +1))
#+END_SRC

* Misc
** Doc view keybindings

#+begin_src emacs-lisp
(use-package doc-view
  :config
  (add-hook 'doc-view-mode-hook (lambda () (centered-cursor-mode -1)))
  (define-key doc-view-mode-map (kbd "<right>") 'doc-view-next-page)
  (define-key doc-view-mode-map (kbd "<left>") 'doc-view-previous-page)
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse

  (global-set-key (kbd "C-<wheel-up>") 'doc-view-enlarge)
  (global-set-key (kbd "C-<wheel-down>") 'doc-view-shrink)

  (setq doc-view-continuous t))
#+end_src

** Remove ad-handle message
#+BEGIN_SRC emacs-lisp
(setq ad-redefinition-action 'accept)
#+END_SRC
